RVishnuradhan/SIH-PROJECT/firmware/anc_unit/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3-WROOM-1-N16R8: 16 MB quad flash, 8 MB octal PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Logs go to the UART port only. The native USB port carries nothing but the
# recording protocol, so log lines can never corrupt the binary audio stream.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# The canceller runs every sample; build for speed, not for step-through
# debugging (the default -Og is 2-3x slower on these loops).
CONFIG_COMPILER_OPTIMIZATION_PERF=y
